Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཕྱོགས་དང་ཕྱོགས་འཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་སོང་ཞིང་། སེམས་ཅན་གང་ལ་སྦྱིན་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། སྦྱིན་པས་ཕན་འདོགས་སོ།
en: They may traverse the world systems of the cardinal and intermediate directions, and they benefit through their generosity those beings who are to be benefited through generosity.

source: །སེམས་ཅན་གང་ལ་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི་ཤེས་རབ་ཀྱིས་ཕན་འདོགས་སོ།
en: They benefit with their ethical discipline, tolerance, perseverance, meditative concentration, and wisdom those beings who are to be benefited through wisdom [and so forth].

source: །སེམས་ཅན་གང་ལ་བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། བསམ་གཏན་བཞི་པས་ཕན་འདོགས་སོ།
en: They benefit with the first meditative concentration, the second meditative concentration, the third meditative concentration, and the fourth meditative concentration those beings who are to be benefited through the fourth meditative concentration [and so forth].

source: །སེམས་ཅན་གང་ལ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པས་ཕན་འདོགས་སོ།
en: They benefit with the absorption in the sphere of infinite space, the absorption in the sphere of infinite consciousness, the absorption in the sphere of nothing-at-all, and the absorption in the sphere of neither perception nor nonperception those beings who are to be benefited through the absorption in the sphere of neither perception nor nonperception [and so forth].

source: །སེམས་ཅན་གང་ལ་བྱམས་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། བྱམས་པས་ཕན་འདོགས་སོ།
en: They benefit through loving kindness those beings who are to be benefited through loving kindness.

source: །སེམས་ཅན་གང་ལ་སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཀྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། བཏང་སྙོམས་ཀྱིས་ཕན་འདོགས་སོ། །སེམས་ཅན་གང་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱིས་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: They benefit through compassion, empathetic joy, and equanimity those beings who are to be benefited through equanimity [and so forth].

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། སྙིང་རྗེ་ཆེན་པོས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། སྙིང་རྗེ་ཆེན་པོས་ཕན་འདོགས་སོ།
en: They benefit through the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and great compassion those who are to be benefited through great compassion [and so forth].

source: །གང་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་ཕན་འདོགས་སོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: They benefit through [the goals], up to and including all-aspect omniscience, those beings who are to be benefited through all-aspect omniscience [and so forth].”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པས་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཟས་འདོད་པ་རྣམས་ལ་ཟས། སྐོམ་འདོད་པ་རྣམས་ལ་སྐོམ། བཞོན་པ་འདོད་པ་རྣམས་ལ་བཞོན་པ། ཕྲེང་བ་འདོད་པ་རྣམས་ལ་ཕྲེང་བ། སྤོས་འདོད་པ་རྣམས་ལ་སྤོས།
en: Subhūti then asked, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they benefit beings through generosity?” “

source: བྱུག་པ་འདོད་པ་རྣམས་ལ་བྱུག་པ། གོས་འདོད་པ་རྣམས་ལ་གོས། མལ་ཆ་འདོད་པ་རྣམས་ལ་མལ་ཆ། གནས་འདོད་པ་རྣམས་ལ་གནས་དང་མིའི་ཡོ་བྱད་གང་ཡང་རུང་བའི་བར་དུ་ཡོངས་སུ་གཏོང་སྟེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་འབུལ་ཞིང་ཡོངས་སུ་གཏོང་བ་དང་། ཇི་ལྟར་རང་སངས་རྒྱས་རྣམས་དང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they dispense food to those who need food, drink to those who need drink, transport to those who need transport, garlands to those who need garlands, perfume to those who need perfume, unguents to those who need unguents, clothing to those who need clothing, bedding to those who need bedding, dwellings to those who need dwellings, and so on, up to and including whichever resources are appropriate. {

source: དགྲ་བཅོམ་པ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་།
en: Ki.

source: རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ཡང་དག་པར་སོང་བ་རྣམས་དང་། ཡང་དག་པར་ཞུགས་པ་རྣམས་ལ་ཡོངས་སུ་གཏོང་བ་དེ་བཞིན་དུ་མིར་གྱུར་པ་རྣམས་དང་། དེ་བཞིན་དུ་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཐ་དད་དུ་བྱ་བ་མེད་པའི་འདུ་ཤེས་ཉེ་བར་གཞག་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་།
en: VIII: 48} Just as they make offerings and donations to the tathāgatas, arhats, completely awakened buddhas, and just as they make donations to pratyekabuddhas, arhats, those no longer subject to rebirth, those destined for only one more rebirth, those who have entered the stream to nirvāṇa, those who have progressed in an authentic direction, and those who have set out in an authentic direction, in the same way they also dispense their generosity to all beings, including those who are human beings and those who have been born as animals, based on the notion that phenomena are undifferentiated.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ཐ་དད་དུ་བྱ་བ་མེད་པ་སྟེ།
en: If you ask why, it is because all phenomena are undifferentiated.

source: དེས་ཐ་དད་དུ་བྱ་བ་མེད་པའི་སྦྱིན་པ་བྱིན་པས། ཐ་དད་དུ་བྱ་བ་མེད་པའི་ཆོས་འདི་ལྟ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །རབ་འབྱོར་གལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས།
en: By dispensing undifferentiated generosity, they attain that which is undifferentiated, all-aspect omniscience. “

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སྲོག་ཆགས་སྦྱིན་པའི་གནས་མ་བྱིན་པ་མཐོང་ནས། འདི་སྙམ་དུ་བདག་གི་སྦྱིན་གནས་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏེ། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པ་མ་ཡིན་ནོ། །སྙམ་ན། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Subhūti, if bodhisattva great beings were to perceive living creatures included within the animal realm as not worthy recipients of their generosity, and were to think, ‘The worthy recipient of my generosity is the completely awakened buddha, but not those included in the animal realm,’ then they would lack the attributes of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། འདི་ལྟར་བདག་གིས་སེམས་ཅན་འདི་དག་ལ་ནི། སྦྱིན་པས་ཕན་གདགས་པར་བྱའོ། །འདི་དག་ལ་ནི་སྦྱིན་པས་ཕན་གདགས་པར་མི་བྱའོ། །ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ།
en: If you ask why, it is because bodhisattva great beings who have set their minds on enlightenment and then reflected that they should benefit some beings through their generosity, but not benefit others through their generosity, have not entered authentically upon unsurpassed, complete enlightenment.

source: ཡང་དག་པར་ཞུགས་པ་མ་ཡིན་ཏེ། དེ་དག་སྦྱིན་པས་ཕན་བཏགས་ནས། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ།
en: After benefiting them all through generosity, they will be reborn within great and lofty royal families.

source: བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ།
en: They will be reborn within great and lofty priestly families.

source: ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: They will be reborn within great and lofty householder families.

source: སྦྱིན་པ་དེ་ཉིད་ཀྱིས་ཕན་བཏགས་པ་དེ་དག །ཐེག་པ་གསུམ་གྱིས་རིམ་གྱིས་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་རོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ། སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ཀྱིས། གསད་པར་གསོལ་བ་བཏབ་ན།
en: Then those who have benefited from this same generosity will gradually, by means of the three vehicles, attain final nirvāṇa in the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates. “

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སྦྱིན་ནོ་སྙམ་འམ། མི་སྦྱིན་ནོ་སྙམ་པའི་སེམས་གཞན་བསྐྱེད་པར་མི་བྱའི། འཁྲུག་པ་མེད་པའི་སེམས་ཀྱིས། སྐྱེ་བོའི་ཚོགས་དེ་དག་ལ་སྦྱིན་པར་བྱའོ།
en: If all the mass of living creatures were to resolve to kill bodhisattva great beings, those bodhisattva great beings should not set their minds on another course, wondering whether to give to them or not to give to them, but instead should dispense generosity to those masses of living creatures with an undisturbed mind.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ། ཡང་དག་པར་ཞུགས་པའི་ཕྱིར། གལ་ཏེ་རྣམ་པར་རྟོག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་།
en: If you ask why, it is because they have authentically set out toward unsurpassed, complete enlightenment for the sake of all beings.

source: རང་སངས་རྒྱས་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། སློབ་པ་རྣམས་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི། འཇིག་རྟེན་གྱིས་སྨད་པར་འགྱུར་ཏེ། དེ་ལ་ཐོག་མར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མགོན་གྱིས་ཤིག །ཅེ་འམ། གནས་དང་། སྐྱབས་དང་། དཔུང་གཉེན་གྱིས་ཤིག །ཅེས་སུས་གསོལ་བ་གདབ་ཅེས་སྨད་པར་འགྱུར་རོ། །རབ་འབྱོར་གཞན་ཡང་། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། དྲུང་དུ་མིར་གྱུར་པ་འམ། མི་མ་ཡིན་པར་གྱུར་པ་དག་འོངས་ཞེས།
en: If they were to discriminate, the lord buddhas, the bodhisattva great beings, the pratyekabuddhas, arhats, and disciples, as well as the world with its gods, humans, and asuras, who have requested them from the start to be a lord-protector of all beings, or to be their sanctuary, refuge, or ally, would then reproach them. “

source: བདག་ནི་སློངས་མོ་བའོ། །ཞེས་ཡན་ལག་དང་། ཉིང་ལག་གཅད་པར་གསོལ་བ་བཏབ་ན། དེའི་ཚེ་དེས་སྦྱིན་ནམ། མི་སྦྱིན་སྙམ་པའི་སེམས་གཉིས་སུ་བསྐྱེད་པར་མི་བྱའོ།
en: Moreover, Subhūti, if human or nonhuman beings were to approach bodhisattva great beings, asking to sever their limbs and appendages, saying, ‘I am your supplicant,’ at that time they should not be of two minds, wondering whether they should give them or not give them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས། སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཆེད་དུ་བསམས་ཏེ། ལུས་འདིས་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱའོ། །ཞེས་ལུས་ཡོངས་སུ་བཟུང་བས་ན། དེ་འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་འདི་དག་གི་དོན་དུ། ལུས་ཡོངས་སུ་བཟུང་བཟུང་བས་དེ་དག་བསླང་མི་དགོས་པར་ཁྱེར་ཞིང་དེང་ཤིག །
en: If you ask why, because these bodhisattva great beings have assumed their physical body for the sake of beings with the aspiration that they should act for the benefit of all beings through their physical body, they should set their minds on the thought, ‘Since I have assumed this physical body for the sake of these beings, may they carry it off and depart without having to ask for it!’

source: ཅེས་སེམས་བསྐྱེད་པར་བྱ་སྟེ། རབ་འབྱོར་དེ་ལྟར།
en: Subhūti, it is in this manner {Ki.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: VIII: 49} that bodhisattva great beings should train in the perfection of wisdom. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སློངས་མོ་བ་མཐོང་ན། འདི་སྙམ་དུ་ཆོས་འདི་དག་ཐམས་ཅད་ཀྱི་རང་བཞིན་དམིགས་སུ་མེད་ན། འདི་ལ་སུ་ཞིག་ནི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་། སུ་ལ་ནི་སྦྱིན་པར་བྱ། ཅི་ཞིག་སྦྱིན་པར་བྱ།
en: Moreover, Subhūti, when bodhisattva great beings see a beggar, they should think, ‘Since the inherent existence of anything cannot be apprehended, who is it that dispenses generosity, to whom should generosity be dispensed, and what should be dispensed?’

source: ཞེས་སེམས་བསྐྱེད་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་འདི་དག་ནི། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་སྟེ།
en: If you ask why, it is because these phenomena are empty, owing to the emptiness of the unlimited.

source: སྟོང་པ་ཉིད་ལ་ནི་གང་ལ་ཡང་ཡོངས་སུ་གཏོང་བ་འམ། གང་ལས་ཀྱང་ཕྲོགས་པ་མེད་དོ། །རབ་འབྱོར་དེ་ལྟར།
en: In emptiness there is nothing to which [generosity] is dispensed nor is there anything from which it is taken away.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ།
en: It is thus, Subhūti, that bodhisattva great beings should train in the perfection of wisdom, that is to say, in the emptiness of internal phenomena and in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དེ་སྟོང་པ་ཉིད་ལ་གནས་ཤིང་སྦྱིན་པ་གཏོང་ན། དེའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: When they dispense generosity, abiding in emptiness, they will always perfect their perfection of generosity, without interruption.

source: དེའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་དེས། ཕྱི་ནང་གི་ཆོས་ལ་བཅད་ཅིང་གཏུབས་ཀྱང་། བདག་ལ་སུ་ཡང་གཏུབ་པ་འམ། གཅོད་སྙམ་པའི་སེམས་མི་འབྱུང་ངོ་།
en: Those who have perfected their perfection of generosity will not think there is anyone cutting or severing them, even though their outer and inner attributes may be severed or cut. “

source: །རབ་འབྱོར་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆེད་དུ་བསམས་ཏེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དག་ཏུ་དོང་ཞིང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་ཞི་བར་བྱས་ནས།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see that there are bodhisattva great beings who have deliberately journeyed to the great hells and after alleviating the sufferings of the great hells, teach the Dharma to those denizens of the hells by means of three sorts of miracles—miraculous magical abilities, miraculous revealing, and miraculous instructing.

source: རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་། ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གསུམ་པོ་དེ་དག་གིས་སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་ཅིང་། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་ཞི་བར་བྱས་ཏེ། ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་།
en: Through miraculous magical abilities, they have alleviated the sufferings of the great hells and then through miraculous revealing and miraculous instructing they teach the Dharma.

source: རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་ཆོས་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོས་ཆོས་སྟོན་ཏེ།
en: Indeed, these bodhisattva great beings teach the Dharma through loving kindness, compassion, empathetic joy, and equanimity.

source: དེས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་སེམས་མོས་པར་བྱས་ཤིང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ནས་རྣམ་པར་ལྡང་བ་དང་། དེ་དག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ནས། རྣམ་པར་ལངས་ནས་ལྷ་དང་མི་དག་དང་། སྐལ་བ་མཉམ་པར་སྐྱེས་ཤིང་།
en: Consequently, beings of the hells believe in those bodhisattva great beings, they become elevated from those great hells, they arise from those great hells and are born as gods and as human beings in accord with their fortune, and gradually they put an end to suffering by means of the three vehicles. “

source: རིམ་གྱིས་ཐེག་པ་གསུམ་གྱིས་སྡུག་བསྔལ་མཐར་འབྱིན་པ་མཐོང་ངོ་། །རབ་འབྱོར་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see that there are bodhisattva great beings who have deliberately journeyed to the great hells and after alleviating the sufferings of the great hells, teach the Dharma to those denizens of the hells by means of three sorts of miracles—miraculous magical abilities, miraculous revealing, and miraculous instructing. {

source: ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆེད་དུ་བསམས་ཏེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དག་ཏུ་དོང་ཞིང་།
en: Ki.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་ཞི་བར་བྱས་ནས། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་། ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གསུམ་པོ་དེ་དག་གིས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་ཅིང་། རྫུ་འཕྲུལ་ཀྱི་ཆོ་འཕྲུལ་གྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་དེ་དག་ཞི་བར་བྱས་ཏེ། ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་དང་།
en: VIII: 50} Through miraculous magical abilities they have alleviated the sufferings of the great hells and then through miraculous revealing and miraculous instructing they teach the Dharma.

source: རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་ཆོས་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོས་ཆོས་སྟོན་ཏེ། དེས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག །
en: Indeed, these bodhisattva great beings teach the Dharma through loving kindness, compassion, empathetic joy, and equanimity.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་མོས་པར་བྱས་ཤིང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ནས་རྣམ་པར་ལྡང་བ་དང་། དེ་དག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ནས་རྣམ་པར་ལངས་ནས། ལྷ་དང་མི་དག་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་ཤིང་། རིམ་གྱིས་ཐེག་པ་གསུམ་གྱིས་སྡུག་བསྔལ་མཐར་འབྱིན་པ་མཐོང་ངོ་།
en: Consequently, beings of the hells believe in those bodhisattva great beings, they become elevated from those great hells, they arise from those great hells and are born as gods and as human beings in accord with their fortune, and gradually they put an end to suffering by means of the three vehicles. “

source: །རབ་འབྱོར་ངས་འདི་ཉིད་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པ་རྣམས་མཐོང་སྟེ།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see that there are bodhisattva great beings who are venerating the lord buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་དགྱེས་པར་མི་འགྱུར་བར་མ་ཡིན་གྱི། དགྱེས་པར་འགྱུར་བ་དང་། ཐུགས་སུ་མི་བྱོན་པས་མ་ཡིན་གྱི། ཐུགས་སུ་བྱོན་པ་དང་། མ་གུས་པས་མ་ཡིན་གྱི།
en: Those bodhisattva great beings venerate the lord buddhas in such a way that they only please them and never fail to please them, are only accepted by them and never fail to be accepted by them, and only respect them and never fail to respect them.

source: གུས་པར་ཤིན་ཏུ་དང་བས་བསྙེན་བཀུར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་བསྟན་པ་དེ་ཡང་འཛིན་ཅིང་། བཟུང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་འཆང་ཞིང་ནམ་དུ་ཡང་ཆུད་མི་གསོན་ཏོ།
en: Those bodhisattva great beings maintain the Dharma taught by those lord buddhas, and having maintained it, they retain it and never squander it until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པ་རྣམས་མཐོང་སྟེ།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see that there are bodhisattva great beings who are venerating the lord buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་དགྱེས་པར་མི་འགྱུར་བར་མ་ཡིན་གྱི། དགྱེས་པར་འགྱུར་བ་དང་། ཐུགས་སུ་མི་བྱོན་པས་མ་ཡིན་གྱི་ཐུགས་སུ་བྱོན་པ་དང་། མ་གུས་པས་མ་ཡིན་གྱི། གུས་པས་ཤིན་ཏུ་དང་བར་བསྙེན་བཀུར་བྱེད་ཅིང་།
en: Those bodhisattva great beings venerate the lord buddhas in such a way that they only please them and never fail to please them, are only accepted by them and never fail to be accepted by them, and only respect them and never fail to respect them.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་གང་བསྟན་པ་དེ་ཡང་འཛིན་ཅིང་བཟུང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་འཆང་ཞིང་ནམ་དུ་ཡང་ཆུད་མི་གཟོན་ཏོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་བདུན་པ། །རབ་འབྱོར་ང་ས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས། འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན།
en: Those bodhisattva great beings maintain the Dharma taught by those lord buddhas, and having maintained it, they retain it and never squander it until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བདག་ཡོངས་སུ་གཏོང་བ་བྱེད་ཅིང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཡན་ལག་དང་། ཉིང་ལག་བཅད་ཅིང་གཏུབས་ཏེ། ཕྱོགས་བཅུར་རྣམ་པར་འཐོར་བ་དང་།
en: Also, Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see those bodhisattva great beings sacrificing themselves for the sake of beings in the animal realm; the limbs and appendages of these bodhisattva great beings being severed, cut, and scattered in the ten directions; and beings, including those of the animal realm, feeding upon the flesh of those bodhisattva great beings.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཤ་ཟོས་ནས། དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བྱམས་པ་འཐོབ་པ་དང་། དེ་དག་བྱམས་པ་ཐོབ་པ་དེས། བྱོལ་སོང་གི་སྐྱེ་གནས་ནས་རྣམ་པར་ལྡང་ཞིང་། རྣམ་པར་ལངས་ནས་ལྷ་དང་མིའི་ནང་དུ་སྐྱེ་བ་དང་།
en: Consequently, they acquire loving kindness for those bodhisattva great beings, and having acquired loving kindness they become elevated from the animal realm, arise therefrom, and are born among the gods and human beings.

source: དེ་དག་ཏུ་སྐྱེས་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་བྱེད་པ་དང་། དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཐོས་ཏེ། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་པ་དང་།
en: Having been born in these realms, they also please the lord buddhas, venerate the lord buddhas, and listen to the Dharma from the lord buddhas.

source: དེ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ་ཐེག་པ་ཆེན་པོ་འམ། ཐེག་པ་གསུམ་པོ་དེ་དག་གིས་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་རིམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཐོང་སྟེ།
en: Emphasizing the real nature, by means of the three vehicles—the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the great vehicle—they gradually attain final nirvāṇa in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates.
